vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE13Z9_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>MKE13Z9_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for MKE13Z9</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="17.0.0" date="2023-12-27">NXP CMSIS Packs based on MCUXpresso SDK 2.14.1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="MKE13Z9" Dvendor="NXP:11">
      <description>
        Kinetis KE1xZ-96 MHz, Mainstream with Touch Interface 5V Microcontrollers based on ARM Cortex-M0+
      </description>
      <device Dname="MKE13Z512xxx9">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/MKE13Z9/iar/MKE13Z512xxx9_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" start="0x14000000" size="0x1000" access="rw" default="1"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x080000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x1fff8000" size="0x018000" access="rw" default="1"/>
        <algorithm name="devices/MKE13Z9/arm/MKE1x_P512_2KB_SEC.FLM" start="0x00000000" size="0x00080000" RAMstart="0x1fff8000" RAMsize="0x00001000" default="1"/>
        <debug svd="devices/MKE13Z9/MKE13Z9.xml"/>
        <variant Dvariant="MKE13Z512VLL9">
          <compile header="devices/MKE13Z9/fsl_device_registers.h" define="CPU_MKE13Z512VLL9"/>
        </variant>
        <variant Dvariant="MKE13Z512VLH9">
          <compile header="devices/MKE13Z9/fsl_device_registers.h" define="CPU_MKE13Z512VLH9"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.MKE13Z9.internal_condition">
      <accept Dname="MKE13Z512VLH9" Dvendor="NXP:11"/>
      <accept Dname="MKE13Z512VLL9" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.device=MKE13Z9.internal_condition">
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.cmsis_drivers.condition_id">
      <require condition="allOf.device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.lists.condition_id">
      <require condition="allOf.driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device=MKE13Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.log.condition_id">
      <require condition="allOf.driver.common, utility.str, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.str, device=MKE13Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console, device=MKE13Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.log.backend.debug_console_lite.condition_id">
      <require condition="allOf.component.log, driver.common, utility.debug_console_lite, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, utility.debug_console_lite, device=MKE13Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.log.backend.ringbuffer.condition_id">
      <require condition="allOf.component.log, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.component.log, driver.common, device=MKE13Z9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="log"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="component.lpspi_adapter.condition_id">
      <require condition="allOf.driver.common, driver.lpspi, device=MKE13Z9.internal_condition"/>
    </condition>
