vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE13Z9_DFP.pdsc
    <condition id="allOf.CMSIS_Driver_Include.SPI, anyOf=allOf=driver.lpspi, device_id=MKE13Z512xxx9, device.RTE, device_id=MKE13Z512xxx9, driver.lpspi_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="SPI" Capiversion="2.3.0"/>
      <require condition="anyOf.allOf=driver.lpspi, device_id=MKE13Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpspi, device_id=MKE13Z512xxx9.internal_condition">
      <accept condition="allOf.driver.lpspi, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpspi, device_id=MKE13Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_lpuart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MKE13Z512xxx9, device.RTE, device_id=MKE13Z512xxx9, driver.lpuart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, anyOf=allOf=driver.lpuart, device_id=MKE13Z512xxx9, device.RTE, device_id=MKE13Z512xxx9, driver.lpuart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require condition="anyOf.allOf=driver.lpuart, device_id=MKE13Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart_edma"/>
    </condition>
    <condition id="anyOf.allOf=driver.lpuart, device_id=MKE13Z512xxx9.internal_condition">
      <accept condition="allOf.driver.lpuart, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.lpuart, device_id=MKE13Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.cmsis_uart.condition_id">
      <require condition="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKE13Z512xxx9, driver.uart_edma.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Driver_Include.USART, device.RTE, driver.uart, device_id=MKE13Z512xxx9, driver.uart_edma.internal_condition">
      <require Cclass="CMSIS Driver" Cgroup="USART" Capiversion="2.4.0"/>
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart_edma"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.crc.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.dmamux.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.edma.condition_id">
      <require condition="allOf.driver.common, driver.dmamux, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.dmamux, device_id=MKE13Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.ewm.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flash.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flexio.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flexio_i2c_master.condition_id">
      <require condition="allOf.driver.flexio, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="allOf.driver.flexio, device_id=MKE13Z512xxx9.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio"/>
      <require condition="device_id.MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi.condition_id">
      <require condition="allOf.driver.flexio, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flexio_spi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_spi, driver.edma, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_spi, driver.edma, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_spi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.edma.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
