vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE13Z9_DFP.pdsc
    <condition id="driver.flexio_uart.condition_id">
      <require condition="allOf.driver.flexio, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.flexio_uart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.flexio_uart, driver.edma, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.flexio_uart, driver.edma, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flexio_uart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.ftm.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.lpi2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpi2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.gpio.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.lpi2c_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpi2c, driver.edma, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpi2c, driver.edma, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.lpit.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.lpspi.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.lpspi_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpspi, driver.edma, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpspi, driver.edma, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.lptmr.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.lpuart.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.lpuart_edma.condition_id">
      <require condition="allOf.anyOf=driver.edma, driver.lpuart, driver.edma, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.edma, driver.lpuart, driver.edma, device=MKE13Z9.internal_condition">
      <require condition="anyOf.driver.edma.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpuart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require condition="device.MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpi2c, driver.common, device=MKE13Z9.internal_condition"/>
    </condition>
    <condition id="driver.pmc.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
    <condition id="driver.port.condition_id">
      <require condition="allOf.driver.common, device_id=MKE13Z512xxx9.internal_condition"/>
    </condition>
