vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.MKE13Z9_DFP.pdsc
    <component Cclass="Device" Cgroup="CMSIS" Csub="MKE13Z9_system" Cversion="1.0.0" condition="device.system.condition_id">
      <description>Device MKE13Z9_system</description>
      <files>
        <file category="sourceC" name="devices/MKE13Z9/system_MKE13Z9.c" projectpath="device"/>
        <file category="header" name="devices/MKE13Z9/system_MKE13Z9.h" projectpath="device"/>
        <file category="include" name="devices/MKE13Z9/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="acmp" Cversion="2.3.0" condition="driver.acmp.condition_id">
      <description>ACMP Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_acmp.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_acmp.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="adc" Cversion="2.0.8" condition="driver.adc12.condition_id">
      <description>ADC12 Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_adc12.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_adc12.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="clock" Cversion="2.0.0" condition="driver.clock.condition_id">
      <description>Clock Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_clock.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_clock.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Csub="lpi2c_cmsis" Cversion="2.6.0" Capiversion="2.3.0" condition="driver.cmsis_lpi2c.condition_id">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/cmsis_drivers/fsl_lpi2c_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/cmsis_drivers/fsl_lpi2c_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Csub="lpspi_cmsis" Cversion="2.12.0" Capiversion="2.2.0" condition="driver.cmsis_lpspi.condition_id">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/cmsis_drivers/fsl_lpspi_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/cmsis_drivers/fsl_lpspi_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="lpuart_cmsis" Cversion="2.7.0" Capiversion="2.3.0" condition="driver.cmsis_lpuart.condition_id">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/cmsis_drivers/fsl_lpuart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/cmsis_drivers/fsl_lpuart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Cversion="2.2.0" Capiversion="2.3.0" condition="driver.cmsis_uart.condition_id">
      <description>UART CMSIS Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/cmsis_drivers/fsl_uart_cmsis.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/cmsis_drivers/fsl_uart_cmsis.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/cmsis_drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="common" Cversion="2.6.0" condition="driver.common.condition_id">
      <description>common Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_common.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_common.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="sourceC" name="devices/MKE13Z9/drivers/fsl_common_arm.c" projectpath="drivers"/>
        <file condition="allOf.cores=cm0p.condition_id" category="header" name="devices/MKE13Z9/drivers/fsl_common_arm.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="crc" Cversion="2.0.4" condition="driver.crc.condition_id">
      <description>CRC Driver</description>
      <files>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_crc.c" projectpath="drivers"/>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_crc.h" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux" Cversion="2.1.3" condition="driver.dmamux.condition_id">
      <description>DMAMUX Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_dmamux.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_dmamux.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="edma" Cversion="2.4.5" condition="driver.edma.condition_id">
      <description>EDMA Driver</description>
      <files>
        <file category="header" name="devices/MKE13Z9/drivers/fsl_edma.h" projectpath="drivers"/>
        <file category="sourceC" name="devices/MKE13Z9/drivers/fsl_edma.c" projectpath="drivers"/>
        <file category="include" name="devices/MKE13Z9/drivers/"/>
      </files>
    </component>
